# Тема 
# Условные операторы используются для выполнения определенных блоков
# кода в зависимости от выполнения условий.
# Условие проверяется на истинность (True) или ложность (False).

#    if: проверяет условие.
#    elif (опционально): проверяет дополнительное условие, если предыдущее не выполнено.
#    else: выполняется, если ни одно из условий не было выполнено.

#  Операторы

# >   больше
# < #  меньше
# == # равно
# >=  # больше или равно
# <=  # меньше или равно
# !=  # не равно

# and #  и
# or  #  или
# not #  не

# 1 практика

# number = 3
# if number == 5:
#     print("бул сан барабар")

# elif number > 5:
#     print("бул сан кичине")
    
# else:
#     print("Ошибка")

# 2 практика вход логин и пароль

# login = input("Логин") 
# password = input("Ведите пароль")

# if login == "adytime"
# print("вы вошли в систему")

# a = not 5 == 4 #не противоположность 
# print(a)

# a = int(input("Выведите оценку: "))

# if a == 5:
#     print("Отличник")
# elif a == 4:
#     print("Хорошо!")
# elif a == 3:
#     print("плохой ученик")
    
# elif a == 2:
#     print("Не достаточно зания.")
# else: 
#     print("error")

